#ifndef JSONRPC_SERVICE_H
#define JSONRPC_SERVICE_H

#include "jsonrpc.h"
#include "defs.h"
#include "common_queue.h"
EXTERN_C_BLOCK

/**********************************************************************
 * 函数名称：jsonrpc_service_create
 * 功能描述：创建JSON-RPC服务端
 * 输入参数：无
 * 输出参数：无
 * 返 回 值：    状态码
 * 其它说明：
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2025/11/10        V1.0              chengjiahao
 ***********************************************************************/
HANDLE jsonrpc_service_create(int port);

/**********************************************************************
 * 函数名称：jsonrpc_service_free
 * 功能描述：释放JSON-RPC服务端
 * 输入参数：无
 * 输出参数：无
 * 返 回 值：    状态码
 * 其它说明：
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2025/11/10        V1.0              chengjiahao
 ***********************************************************************/
void jsonrpc_service_free(HANDLE hService);

/**********************************************************************
 * 函数名称：jsonrpc_service_start
 * 功能描述：启动JSON-RPC服务端
 * 输入参数：无
 * 输出参数：无
 * 返 回 值：    状态码
 * 其它说明：
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2025/11/10        V1.0              chengjiahao
 ***********************************************************************/
int jsonrpc_service_start(HANDLE hservice);

/**********************************************************************
 * 函数名称：jsonrpc_service_stop
 * 功能描述：停止JSON-RPC服务端
 * 输入参数：无
 * 输出参数：无
 * 返 回 值：    状态码
 * 其它说明：
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2025/11/10        V1.0              chengjiahao
 ***********************************************************************/
void jsonrpc_service_stop(HANDLE hservice);

/**********************************************************************
 * 函数名称：JsonRpcServerAllocMsg
 * 功能描述：获取JSON-RPC消息
 * 输入参数：无
 * 输出参数：无
 * 返 回 值：    状态码
 * 其它说明：
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2025/11/10        V1.0              chengjiahao
 ***********************************************************************/
T_JsonRpcMsg* JsonRpcServerAllocMsg(HANDLE hService, UINT32 timeout);

/**********************************************************************
 * 函数名称：JsonRpcServerFreeMsg
 * 功能描述： 释放JSON-RPC消息
 * 输入参数：无
 * 输出参数：无
 * 返 回 值：    状态码
 * 其它说明：
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2025/11/10        V1.0              chengjiahao
 ***********************************************************************/
E_StateCode JsonRpcServerFreeMsg(HANDLE hService, T_JsonRpcMsg* ptMsg);

/**********************************************************************
 * 函数名称：JsonRpcServerReply
 * 功能描述：回复JSON-RPC消息
 * 输入参数：无
 * 输出参数：无
 * 返 回 值：    状态码
 * 其它说明：
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2025/11/10        V1.0              chengjiahao
 ***********************************************************************/
void JsonRpcServerReply(HANDLE hService, UINT32 uiCallId, E_StateCode eCode, void *data);

EXTERN_C_BLOCK_END

#endif // JSONRPC_SERVICE_H